{
	"About": {
		"name": "Lucas Sobczak",
		"title": "Full Stack Developer",
		"location": "Toronto, ON",
		"email": "lucassobczak3@gmail.com"
	},
	"Projects": [
		{
			"id": 1,
			"title": "ASCII Art Generator",
			"description": "",
			"year": "2024",
			"image": "",
			"link": "https://github.com/SobczakL/ASCII-gen.git"
		},
		{
			"id": 2,
			"title": "Röra",
			"description": "A user-friendly web app for quick access to nearby transit info. We used React and Chakra UI for a smooth front-end, while Node.js, Express.js, Knex.js, and MySQL power the efficient back end. Real-time transit data is seamlessly integrated via the Transit API, supporting dynamic updates and robust route searches. Our app is hosted on Vercel for reliability, with data stored securely on PlanetScale for scalability. Röra simplifies travel planning and enhances the user experience.",
			"year": "2023",
			"image": "",
			"link": "https://rora.vercel.app/"
		},
		{
			"id": 3,
			"title": "Retail Calculator",
			"description": "This Retail Math Calculator is a C program designed for retail businesses. It helps users perform basic calculations related to sales, productivity, and inventory metrics. With an easy-to-use menu interface, users can calculate things like average sales, profit margins, and inventory turnover. Whether the user is a small shop or a big retailer, this tool can assist in managing key aspects of your business.",
			"year": "2024",
			"image": "",
			"link": "https://github.com/SobczakL/retail-calculator"
		},
		{
			"id": 4,
			"title": "AI Onboarding",
			"description": "An AI-driven onboarding and retention solution, crafted in collaboration between BrainStation and Shopify. This project involved establishing strategic partnerships with Shopify to enhance accessibility and user engagement. Our solution integrates interactive guides and chatbot assistance for streamlined onboarding. Leveraging advanced technologies like the Shopify Polaris library and NLP.js, we enhance user interaction and support capabilities. Continuous refinement based on user feedback and data analytics reflects our commitment to user-centered design and product enhancement.",
			"year": "2023",
			"image": "",
			"link": "https://github.com/SobczakL/Brainstation-Shopify"
		},
		{
			"id": 5,
			"title": "Weather App",
			"description": "Experience the Weather App, a sophisticated web utility delivering precise weather updates and comprehensive forecasts worldwide. Engineered with JavaScript and enriched by React, it provides seamless interaction and intuitive access to current conditions and detailed forecasts. Utilizing the robust OpenWeatherMap API, accuracy is guaranteed. Simply clone the repository, install dependencies, and explore weather insights with elegance, enhanced by SCSS styling for optimal user experience.",
			"year": "2023",
			"image": "",
			"link": "https://github.com/SobczakL/weather-app"
		}
	],
    "Contact": {
        "name": "Lucas Sobczak",
        "email": "lucassobczak3@gmail.com"
    }
}
